{
	"projects": [
		{
			"project_id": "lemu4-hackintosh",
			"name": "Hackintosh on System76 Lemur Ultra 4",
			"status": "Active",
			"start_date": "April 2013",
			"end_date": null,
			"short_desc": "Patched DSDT, SSDT, and boot config needed for running OS X 10.8.5+ on a System76 Lemur Ultra 4",
			"description": "DSDT, SSDT, and boot config needed for running OS X 10.8.5+ on a System76 Lemur Ultra 4. Effort to get as much hardware working under Mac OS X as possible on my System76 Lemur Ultra 4. Non-working things include changing screen brightness, sound input, VGA, and HDMI audio.",
			"img": {
				"src": null,
				"height": null,
				"width": null
			},
			"links": [
				{
					"title": "Lemu4 Hackintosh config on Github",
					"href": "https://github.com/maxfierke/Lemu4-Hackintosh-Config"
				}
			],
			"categories": [
				"current-projects",
				"desktop"
			]
		},
		{
			"project_id": "watercooler",
			"name": "WaterCooler",
			"status": "Active",
			"start_date": "Jul 3 2013",
			"end_date": null,
			"short_desc": "WaterCooler is a free and open-source group chat application designed for use internally within offices and organizations.",
			"description": "WaterCooler is a free and open-source group chat application designed for use internally within offices and organizations. The intention is to provide a FOSS counterweight to proprietary, SaaS solutions such as Campfire and HipChat, and provide a solution for people looking to host a rich, multi-room chat application behind their firewall on their own hardware.",
			"img": {
				"src": "/static/images/watercooler.png",
				"height": 300,
				"width": 200
			},
			"links": [
				{
					"title": "WaterCooler on Github",
					"href": "https://github.com/maxfierke/WaterCooler"
				}
			],
			"categories": [
				"current-projects",
				"web"
			]
		},
		{
			"project_id": "dwjlth",
			"name": "DoWeJustLeaveTheseHere.com",
			"status": "Active",
			"start_date": "Jun 23 2013",
			"end_date": null,
			"short_desc": "DWJLTH is a single-purpose web \"application\" that gives you information on whether or not you're supposed to leave your dishes",
			"description": "DWJLTH is a single-purpose web \"application\" that gives you information on whether or not you're supposed to leave your dishes at the table after you've finished eating at certain restaurants.<br /><br />Yes, that's all it does.",
			"img": {
				"src": null,
				"height": null,
				"width": null
			},
			"links": [
				{
					"title": "DWJLTH on Github",
					"href": "https://github.com/maxfierke/dwjlth"
				},
				{
					"title": "DoWeJustLeaveTheseHere.com",
					"href": "http://www.dowejustleavethesehere.com"
				}
			],
			"categories": [
				"current-projects",
				"web"
			]
		},
		{
			"project_id": "openskedge",
			"name": "OpenSkedge",
			"status": "Active",
			"start_date": "Dec 23 2012",
			"end_date": null,
			"description": "OpenSkedge is inspired by an old PHP 4 application, <a href=\"http://empscheduler.sourceforge.net\">Employee Scheduler</a>, a flexible scheduling application designed for companies and organizations (such as education institutions with student workers) which require fluid shift scheduling.<br /><br />It's a PHP 5 web application built on the solid and powerful Symfony2 framework and utilizing the Doctrine ORM. It is licensed under th GNU GPL version 3 or later.",
			"img": {
				"src": "/static/images/openskedge.png",
				"height": null,
				"width": null
			},
			"links": [
				{
					"title": "OpenSkedge.org",
					"href": "http://www.openskedge.org"
				},
				{
					"title": "OpenSkedge on GitHub",
					"href": "https://github.com/maxfierke/OpenSkedge"
				},
				{
					"title": "Demo OpenSkedge",
					"href": "http://demo.openskedge.org"
				},
				{
					"title": "Launch your instance for free On PagodaBox",
					"href": "https://pagodabox.com/cafe/m4xm4n/openskedge"
				}
			],
			"categories": [
				"current-projects",
				"web"
			]
		},
		{
			"project_id": "acidify",
			"name":"Acidify",
			"status": "Inactive",
			"start_date": "July 2012",
			"end_date": "April 2013",
			"description": "Acidify is a wrapper for a number of scripts that compose the Android build system. It's purpose is to provide convenience for people building multiple versions of Android (such as CyanogenMod maintainers). It's original purpose was to make it easy for members of TeamAcid to switch between CyanogenMod versions with one command. It also provides a method for installing all the required packages needed for building Android (if using Ubuntu or Linux Mint), including CyanogenMod 7, 9, and the Android Open Kang Project. In addition, it supports local manifests, provides a function for deploying built OTA zips to the device, and uploading ready builds to Goo.im. The script is written in bash and is easily configurable.<br /><br />I'm beginning to rewrite the script in Python to make it more versatile, add a number of missing features, and overcome some of the limitations of what can be done in bash.",
			"img": {
				"src": null,
				"height": null,
				"width": null
			},
			"links": [
				{
					"title": "Acidify on Github",
					"href": "https://github.com/teamacid/acidify"
				}
			],
			"categories": [
				"current-projects",
				"desktop",
				"linux",
				"android"
			]
		},
		{
			"project_id": "cyanogenmod-sgs4g",
			"name":"CyanogenMod for the Samsung Galaxy S 4G",
			"status": "Sporatic Activity (as part of TeamAcid)",
			"start_date": "March 2012",
			"end_date": null,
			"description": "We're an Android hacking team centered around the Samsung Galaxy S 4G and are in the process of porting the aftermarket Android distribution CyanogenMod to the device. Our ultimate goal is getting the device officially supported by the distribution. You can track what we have done by viewing our Github and by visiting the XDA threads linked on <a href=\"http://teamacid.github.com\">our website</a>.",
			"img": {
				"src": "/static/images/teamacid.png",
				"height": null,
				"width": null
			},
			"links": [
				{
					"title": "TeamAcid on Github",
					"href": "https://github.com/teamacid"
				}
			],
			"categories": [
				"current-projects",
				"android"
			]
		},
		{
			"project_id": "fallarium",
			"name":"Fallarium",
			"status": "On Hold",
			"start_date": "March 2012",
			"end_date": "April 2012",
			"description": "Fallarium is an effort to port Damian Yerrick's Tetanus On Drugs(TM) to Allegro 5 and allow it to run on modern computers. TOD is a Tetris-like game with added visual effects commonly associated with hallucinogens. Eventually I wish to update the program with newer graphics, animations, and take advantage of modern GPUs.",
			"img": {
				"src": "/static/images/fallarium.png",
				"height": null,
				"width": null
			},
			"links": [
				{
					"title": "Fallarium on Github",
					"href": "https://github.com/maxfierke/fallarium"
				}
			],
			"categories": [
				"current-projects",
				"desktop",
				"linux"
			]
		},
		{
			"project_id": "bleufear",
			"name":"BleuFear",
			"status": "Inactive",
			"start_date": "November 2011",
			"end_date": null,
			"description": "BleuFear is a theme (technically a collection of themes) with a wild streak of electric blue. It is inspired by the design of my site and everything else that fits that color scheme. The name comes from the french word for blue(duh) and the way Americans pronounce the first part of my last name. (Also, it's a dark theme so fear~=dark).",
			"img": {
				"src": null,
				"height": null,
				"width": null
			},
			"links": [
				{
					"title": "BleuFear on Github",
					"href": "https://github.com/maxfierke/bleufear"
				}
			],
			"categories": [
				"current-projects",
				"desktop",
				"linux"
			]
		},
		{
			"project_id": "sandwichroulette",
			"name":"SandwichRoulette",
			"status": "Inactive",
			"start_date": "May 2011",
			"end_date": "July 2012",
			"description": "SandwichRoulette is an application designed for the indecisive. Like many people, my lunch has been delayed because of my inability to decide on what to put in my sandwiches. This application, designed for Android-powered phones running 2.1 and higher, automates the ingredient choosing process. Creations can be saved and later versions will support sharing the particularly delicious ones. SandwichRoulette is licensed under the GNU General Public License version 3",
			"img": {
				"src": "/static/images/swRouletteLogoAlt.png",
				"height": null,
				"width": null
			},
			"links": [
				{
					"title": "SandwichRoulette on the Google Play Store (Don't worry, it's free)",
					"href": "https://play.google.com/store/apps/details?id=com.maxfierke.sandwichroulette"
				},
				{
					"title": "SandwichRoulette on GitHub",
					"href": "https://github.com/maxfierke/SandwichRoulette"
				}
			],
			"categories": [
				"past-projects",
				"android"
			]
		},
		{
			"project_id": "maustrap",
			"name":"MAUSTRAP",
			"status": "Occasional Movement",
			"start_date": "July 2011",
			"end_date": null,
			"description": "MAUSTRAP or Max’s Absurdly Ugly and Severely TRite Algorithm Project is a little pet project I work on when I'm really bored. It's a crypto project and it's my attempt at a Feistel-based block cipher with S and P-boxes, 128-bit blocks, and a range of key sizes. It takes a few design cues from the Blowfish algorithm. Progress moves very slowly as I don't work on it very often.",
			"img": {
				"src": "/static/images/maus.png",
				"height": null,
				"width": null
			},
			"links": [],
			"categories": [
				"current-projects",
				"crypto"
			]
		},
		{
			"project_id": "arcanecms",
			"name":"ArcaneCMS",
			"status": "Canceled",
			"start_date": "June 2008",
			"end_date": "???",
			"description": "An attempt at an open source content management system designed for myself and eventually the general public. It started out as a PHP application built from scratch but went through a miriad of restructures with different micro-frameworks. The goal of the project was to provide a lightweight content management system that easily integrated with any design without having to learn another extensive API. I lost interest in ArcaneCMS.<br><br> A project called <a href=\"http://bolt.cm\">Bolt</a> was created by Bob den Otter. Bolt is everything I wanted ArcaneCMS to be and more. You should check Bolt out. It's pretty great.<br><br>If you're still interested in ArcaneCMS, you can check out the Github link below.",
			"img": {
				"src": "/static/images/arcaneCMSLogo.png",
				"height": null,
				"width": null
			},
			"links": [
				{
					"title": "ArcaneCMS on Github",
					"href": "https://github.com/maxfierke/arcanecms"
				}
			],
			"categories": [
				"past-projects",
				"web"
			]
		},
		{
			"project_id": "axdroid",
			"name":"AxDroid",
			"status": "Inactive/Canceled",
			"start_date": "July 2010",
			"end_date": "Jan 2011",
			"description": "AxDroid was a project started by Ertan Deniz and continued by Paul Burton. The AxDroid project aimed to get Google's Android operating system into a usable state (with as full hardware support as possible) on the Dell Axim X50(v) and X51(v) Pocket PCs. I was a contributing developer to the project. I wrote the inital PCMCIA driver and did other kernel related work. The project was cancelled after it became apparent that Android would never work for daily use on the devices due to hardware limitations.",
			"img": {
				"src": "/static/images/axdroid_bootlogoQVGA.png",
				"height": 300,
				"width": 200
			},
			"links": [],
			"categories": [
				"past-projects",
				"android",
				"linux"
			]
		}
	]
}
